eisup_2019_docmng_integration/src/InformationRegisters/ГражданствоФизЛиц/ГражданствоФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГражданствоФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Страна</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаПенсию</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьНеЯвляетсяНалоговымРезидентомРФ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИмеетПравоНаМедицинскоеСтрахование</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидЗастрахованногоЛица</name>
    <type>
      <types>EnumRef.ВидыЗастрахованныхЛицОбязательногоСтрахования</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыЗастрахованныхЛицОбязательногоСтрахования/ВидыЗастрахованныхЛицОбязательногоСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗастрахованныхЛицОбязательногоСтрахования</name>
  <enumValues>
    <name>ГражданеРФ</name>
  </enumValues>
  <enumValues>
    <name>ПостоянноПроживающиеИностранцы</name>
  </enumValues>
  <enumValues>
    <name>ВременноПроживающиеИностранцы</name>
  </enumValues>
  <enumValues>
    <name>ВременноПребывающиеИностранцы</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/ГражданствоФизЛиц/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.Страна = Справочники.КлассификаторСтранМира.Россия Тогда
			СтрокаНабора.ВидЗастрахованногоЛица = Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ
		КонецЕсли;
		СтрокаНабора.НеИмеетПравоНаПенсию = СтрокаНабора.ВидЗастрахованногоЛица = Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ВременноПребывающиеИностранцы;
	КонецЦикла;
	
КонецПроцедуры
